RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_dma.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check peripherals */
#define NOT_DMA_PERIPH(periph)                               ((DMA0 != (periph)) && (DMA1 != (periph)))

/* check DMA request */
#define DMA_REQUEST_HIGH                                     DMA_REQUEST_TIMER44_TRG
#define NOT_DMA_REQUEST(request)                             ((DMA_REQUEST_HIGH < (request)) || (RM_CHXCFG_MUXID(28U) == (request)) || (RM_CHXCFG_MUXID(34U) == (request)) || \
                                                              (RM_CHXCFG_MUXID(40U) == (request)) || (RM_CHXCFG_MUXID(73U) == (request)) || (RM_CHXCFG_MUXID(89U) == (request)) || \
                                                              (RM_CHXCFG_MUXID(90U) == (request)) || (RM_CHXCFG_MUXID(91U) == (request)) || (RM_CHXCFG_MUXID(92U) == (request)) || \
                                                              (RM_CHXCFG_MUXID(101U) == (request)) || (RM_CHXCFG_MUXID(102U) == (request)) || (RM_CHXCFG_MUXID(103U) == (request)) || \
                                                              (RM_CHXCFG_MUXID(104U) == (request)) || (RM_CHXCFG_MUXID(117U) == (request)) || (RM_CHXCFG_MUXID(121U) == (request)) || \
                                                              (RM_CHXCFG_MUXID(133U) == (request)) || (RM_CHXCFG_MUXID(140U) == (request)) || (RM_CHXCFG_MUXID(142U) == (request)) || \
                                                              (RM_CHXCFG_MUXID(143U) == (request)) || (RM_CHXCFG_MUXID(144U) == (request)) || (RM_CHXCFG_MUXID(145U) == (request)) || \
                                                              (RM_CHXCFG_MUXID(146U) == (request)) || (RM_CHXCFG_MUXID(147U) == (request)) || (RM_CHXCFG_MUXID(148U) == (request)) || \
                                                              (RM_CHXCFG_MUXID(149U) == (request)) || (RM_CHXCFG_MUXID(150U) == (request)) || (RM_CHXCFG_MUXID(151U) == (request)) || \
                                                              (RM_CHXCFG_MUXID(152U) == (request)) || (RM_CHXCFG_MUXID(153U) == (request)) || (RM_CHXCFG_MUXID(154U) == (request)) || \
                                                              (RM_CHXCFG_MUXID(155U) == (request)) || (RM_CHXCFG_MUXID(178U) == (request)) || (RM_CHXCFG_MUXID(179U) == (request)) || \
                                                              (RM_CHXCFG_MUXID(180U) == (request)) || (RM_CHXCFG_MUXID(181U) == (request)))

/* check DMA periph increase algorithm */
#define NOT_DMA_PERIPH_INCREASE(periph_inc)                  ((DMA_PERIPH_INCREASE_ENABLE != (periph_inc)) && (DMA_PERIPH_INCREASE_DISABLE != (periph_inc)) && \
                                                              (DMA_PERIPH_INCREASE_FIX != (periph_inc)))
                                                              
/* check memory increase algorithm*/
#define NOT_DMA_MEMORY_INCREASE(memory_inc)                  ((DMA_MEMORY_INCREASE_ENABLE != (memory_inc)) && (DMA_MEMORY_INCREASE_DISABLE != (memory_inc)))

/* check DMA periph and memory width */
#define NOT_DMA_PERIPH_MEMORY_WIDTH(periph_memory_width)     ((DMA_PERIPH_WIDTH_8BIT != (periph_memory_width)) && (DMA_PERIPH_WIDTH_16BIT != (periph_memory_width)) && \
                                                              (DMA_PERIPH_WIDTH_32BIT != (periph_memory_width)))

/* check DMA circular mode */
#define NOT_DMA_CIRCULAR_MODE(circular_mode)                 ((DMA_CIRCULAR_MODE_ENABLE != (circular_mode)) && (DMA_CIRCULAR_MODE_DISABLE != (circular_mode)))

/* check DMA transfer direction */
#define NOT_DMA_TRANSFER_DIRECTION(direction)                ((DMA_PERIPH_TO_MEMORY != (direction)) && (DMA_MEMORY_TO_PERIPH != (direction)) && \
                                                              (DMA_MEMORY_TO_MEMORY != (direction)))

/* check DMA number of remaining data to be transferred */
#define DMA_NUMBER_HIGH                                      (65535U)
#define NOT_DMA_NUMBER(number)                               (DMA_NUMBER_HIGH < (number))

/* check DMA priority */
#define NOT_DMA_PRIORITY(priority)                           ((DMA_PRIORITY_LOW != (priority)) && (DMA_PRIORITY_MEDIUM != (priority)) && \
                                                              (DMA_PRIORITY_HIGH != (priority)) && (DMA_PRIORITY_ULTRA_HIGH != (priority)))

/* check DMA periph width */
#define NOT_DMA_PERIPH_WIDTH(periph_width)                   ((DMA_PERIPH_WIDTH_8BIT != (periph_width)) && (DMA_PERIPH_WIDTH_16BIT != (periph_width)) && \
                                                              (DMA_PERIPH_WIDTH_32BIT != (periph_width)))

/* check DMA memory width */
#define NOT_DMA_MEMORY_WIDTH(memory_width)                   ((DMA_MEMORY_WIDTH_8BIT != (memory_width))  && (DMA_MEMORY_WIDTH_16BIT != (memory_width)) && \
                                                              (DMA_MEMORY_WIDTH_32BIT != (memory_width)))

/* check DMA memory burst width */
#define NOT_DMA_MEMORY_BURST_WIDTH(memory_burst_width)       ((DMA_MEMORY_BURST_SINGLE != (memory_burst_width))  && (DMA_MEMORY_BURST_4_BEAT != (memory_burst_width)) && \
                                                              (DMA_MEMORY_BURST_8_BEAT != (memory_burst_width))  && (DMA_MEMORY_BURST_16_BEAT != (memory_burst_width)))

/* check DMA periph burst width */
#define NOT_DMA_PERIPH_BURST_WIDTH(periph_burst_width)       ((DMA_PERIPH_BURST_SINGLE != (periph_burst_width))  && (DMA_PERIPH_BURST_4_BEAT != (periph_burst_width)) && \
                                                              (DMA_PERIPH_BURST_8_BEAT != (periph_burst_width))  && (DMA_PERIPH_BURST_16_BEAT != (periph_burst_width)))
                                                              
/* check DMA FIFO critical value */
#define NOT_DMA_FIFO_CRITICAL_VALUE(critical_value)          ((DMA_FIFO_1_WORD != (critical_value)) && (DMA_FIFO_2_WORD != (critical_value)) && \
                                                              (DMA_FIFO_3_WORD != (critical_value)) && (DMA_FIFO_4_WORD != (critical_value)))

/* check DMA memory flag */
#define NOT_DMA_MEMORY_FLAG(memory_flag)                     ((DMA_MEMORY_0 != (memory_flag))  && (DMA_MEMORY_1 != (memory_flag)))

/* check DMA flag */
#define NOT_DMA_FLAG(flag)                                   ((DMA_FLAG_FEE != (flag)) && (DMA_FLAG_SDE != (flag)) && \
                                                              (DMA_FLAG_TAE != (flag)) && (DMA_FLAG_HTF != (flag)) && \
                                                              (DMA_FLAG_FTF != (flag)))

/* check DMA interrupt */
#define NOT_DMA_INTERRUPT(interrupt)                         ((DMA_INT_SDE != (interrupt))  && (DMA_INT_TAE != (interrupt)) && \
                                                              (DMA_INT_HTF != (interrupt))  && (DMA_INT_FTF != (interrupt)) && \
                                                              (DMA_INT_FEE != (interrupt)))
                                                              
/* check DMA interrupt flag */
#define NOT_DMA_INTERRUPT_FLAG(interrupt_flag)               ((DMA_INT_FLAG_FEE != (interrupt_flag)) && (DMA_INT_FLAG_SDE != (interrupt_flag)) && \
                                                              (DMA_INT_FLAG_TAE != (interrupt_flag)) && (DMA_INT_FLAG_HTF != (interrupt_flag)) && \
                                                              (DMA_INT_FLAG_FTF != (interrupt_flag)))

